# Rpstr_GetValueStr

## Description
Get a string value from the VectorScript value repository.

```pascal
FUNCTION Rpstr_GetValueStr(
				name         : STRING;
				defaultValue : DYNARRAY[] of CHAR) : DYNARRAY[] of CHAR;
```

```python

def vs.Rpstr_GetValueStr(name, defaultValue):
    return DYNARRAY[] of CHAR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|defaultValue|DYNARRAY[] of CHAR|Default value if the name does not exist in the VectorScript value repository.|

## See Also
VS Functions:
Rpstr_RemoveValues| Rpstr_RemoveValue| Rpstr_GetValueBool| Rpstr_SetValueBool| Rpstr_GetValueInt| Rpstr_SetValueInt| Rpstr_GetValueReal| Rpstr_SetValueReal| Rpstr_GetValueStr| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012
## Category
* Utility